src/dind.org
:PROPERTIES:
:ID:       477fec3d-e950-4b45-aeca-f878e1032fe4
:END:
#+TITLE: Docker inside containers
#+LANGUAGE: en
#+PROPERTY: header-args:python :tangle no
#+PROPERTY: header-args:bash   :tangle no :dir (expand-file-name ".." default-directory) :results verbatim :cache yes

Some CI pipelines and integration tests need to build or run Docker
images. I need a way to run Docker inside a Dagger container (DinD),
handling cgroup setup, tmpfs mounts, and dockerd lifecycle.

When running Docker-in-Docker inside a Dagger container, there is a
DNS subnet collision to handle. The outer Dagger engine places the
container on a =10.87.0.0/16= network with a DNS server at
=10.87.0.1=.  When a nested Dagger engine starts inside the DinD
container, it creates its own =dagger0= bridge in the same
=10.87.0.0/16= range.  That route captures all traffic to
=10.87.0.1=, making the DNS server unreachable from containers managed
by the inner engine.

The fix: before starting =dockerd=, save the current DNS server and
tell Docker (via =daemon.json=) to hand out =172.17.0.1= (the Docker
bridge gateway) as the DNS server for containers.  After =dockerd=
creates the bridge, add iptables DNAT rules that forward DNS queries
arriving at =172.17.0.1:53= to the real DNS server.  Containers
managed by the inner Docker — including a nested Dagger engine — can
always reach the bridge gateway, so DNS works transparently.

#+begin_src python :tangle lib/dind.py :noweb yes
import dagger
from dagger import dag, function


_CGROUP_SETUP = (
    "mount -t cgroup2 cgroup2 /sys/fs/cgroup 2>/dev/null || true\n"
    "mkdir -p /sys/fs/cgroup/init\n"
    "xargs -rn1 < /sys/fs/cgroup/cgroup.procs > /sys/fs/cgroup/init/cgroup.procs 2>/dev/null || true\n"
    "sed -e 's/ / +/g' -e 's/^/+/' < /sys/fs/cgroup/cgroup.controllers"
    " > /sys/fs/cgroup/cgroup.subtree_control 2>/dev/null || true\n"
)

_DNS_SETUP = (
    "DNS_SERVER=$(awk '/^nameserver/{print $2; exit}' /etc/resolv.conf)\n"
    "mkdir -p /etc/docker\n"
    'echo \'{"dns": ["172.17.0.1"]}\' > /etc/docker/daemon.json\n'
)

_DOCKERD_START = (
    "start_dockerd() {\n"
    "  rm -f /var/log/dockerd.log\n"
    "  mkdir -p /var/lib/docker\n"
    "  dockerd &>/var/log/dockerd.log &\n"
    "  for i in $(seq 1 30); do docker info &>/dev/null && return 0; sleep 0.2; done\n"
    "  kill %% 2>/dev/null; wait 2>/dev/null\n"
    "  return 1\n"
    "}\n"
    "if ! start_dockerd; then\n"
    "  echo 'dockerd failed to start, wiping /var/lib/docker and retrying...' >&2\n"
    "  rm -rf /var/lib/docker/*\n"
    "  if ! start_dockerd; then\n"
    "    echo '=== dockerd failed after wipe ===' >&2\n"
    "    cat /var/log/dockerd.log >&2\n"
    "    exit 1\n"
    "  fi\n"
    "fi\n"
    "iptables -t nat -A PREROUTING -p udp -d 172.17.0.1 --dport 53"
    " -j DNAT --to-destination $DNS_SERVER:53\n"
    "iptables -t nat -A PREROUTING -p tcp -d 172.17.0.1 --dport 53"
    " -j DNAT --to-destination $DNS_SERVER:53\n"
)


class DindMixin:

    _EMACS_INCLUDE = ["src/", "tests/", "examples/", ".clk/",
                      "dagger.json", ".daggerignore", "pyproject.toml",
                      "*.sh", "*.el", "*.org"]

    <<dind-container>>

    <<dind-with-docker>>

    <<dind-run-tests>>

    <<emacs-container>>

    <<dind-emacs-container>>

    <<dind-tangle>>

    <<dind-run-org>>

    <<dind-init-examples>>

    <<export-html>>
#+end_src

* Installing Docker from the official repository

  This script adds the Docker APT repository and installs Docker CE.
  It is tangled to a standalone shell file so the Python code can
  inject it into the container as-is.

  #+begin_src sh :tangle lib/docker-repo-install.sh :tangle-mode (identity #o755)
#!/bin/sh
set -eu
. /etc/os-release
install -m 0755 -d /etc/apt/keyrings
curl -fsSL "https://download.docker.com/linux/$ID/gpg" \
    -o /etc/apt/keyrings/docker.asc
chmod a+r /etc/apt/keyrings/docker.asc
echo "deb [arch=$(dpkg --print-architecture) \
  signed-by=/etc/apt/keyrings/docker.asc] \
  https://download.docker.com/linux/$ID \
  $VERSION_CODENAME stable" \
    > /etc/apt/sources.list.d/docker.list
apt-get update
apt-get install --yes docker-ce docker-ce-cli containerd.io
  #+end_src

* Preparing a DinD-capable container
  :PROPERTIES:
  :ID:       03b5bc42-932d-49f9-b922-ee7cba52528a
  :END:

  Docker needs to be installed in the container first. This target handles
  adding the Docker APT repository and installing Docker CE.

  #+NAME: dind-container
  #+begin_src python
  @function
  def dind_container(
      self,
      base: dagger.Container | None = None,
  ) -> dagger.Container:
      """Return a container with Docker installed, ready for DinD.

      If base is provided, Docker is installed into it (must be
      Debian/Ubuntu-based).  Otherwise uses Lib.dind_ubuntu_image.
      The Docker APT repo setup is done inline so the container build
      has no dependency on the project source — only the base image and
      package versions affect the cache.
      """
      if base is None:
          base = dag.container().from_(self.dind_ubuntu_image)

      return (
          base
          .with_exec(["apt-get", "update"])
          .with_exec([
              "apt-get", "install", "--yes",
              "ca-certificates", "curl", "gnupg", "iptables",
          ])
          .with_exec([
              "bash", "-c",
              ". /etc/os-release && "
              "install -m 0755 -d /etc/apt/keyrings && "
              "curl -fsSL https://download.docker.com/linux/$ID/gpg"
              " -o /etc/apt/keyrings/docker.asc && "
              "chmod a+r /etc/apt/keyrings/docker.asc && "
              'echo "deb [arch=$(dpkg --print-architecture)'
              " signed-by=/etc/apt/keyrings/docker.asc]"
              " https://download.docker.com/linux/$ID"
              ' $VERSION_CODENAME stable"'
              " > /etc/apt/sources.list.d/docker.list && "
              "apt-get update && "
              "apt-get install --yes docker-ce docker-ce-cli containerd.io",
          ])
      )
  #+end_src

* Running commands with dockerd
  :PROPERTIES:
  :ID:       a02a8270-5268-4bb9-bcbc-56ebb5d5dfd5
  :END:

  Split into two layers so dagger can cache the dockerd-ready state:

  - =dind_setup= starts dockerd — always the same, cacheable.
  - =dind_with_docker= runs the user command on top — varies per call.

  [[https://docs.dagger.io/api/reference#definition-Container][insecure_root_capabilities=True]] tells Dagger to run the command with
  elevated privileges — the container gets the Linux capabilities
  normally stripped for safety (mounting filesystems, managing cgroups,
  etc.). Without this, =dockerd= cannot start because it needs to mount
  =tmpfs= and manipulate cgroups.

  #+NAME: dind-with-docker
  #+begin_src python
  @function
  def dind_with_docker(
      self,
      cmd: str,
      ctr: dagger.Container | None = None,
  ) -> dagger.Container:
      """Run a shell command inside the container with dockerd available.

      Handles cgroup v2 setup, tmpfs for /var/lib/docker,
      and dockerd lifecycle.  These must run in the same exec as the
      user command because processes and mounts do not persist across
      exec boundaries.
      """
      if ctr is None:
          ctr = self.dind_container()
      shell_cmd = _DNS_SETUP + _CGROUP_SETUP + _DOCKERD_START + cmd
      return ctr.with_exec(
          ["bash", "-c", shell_cmd],
          insecure_root_capabilities=True,
      )
  #+end_src

* Running the test suite inside DinD

  Dogfooding: build a container that has everything needed to run the
  project tests (Python, pytest, Dagger CLI) on top of the DinD base,
  then execute =./test-host.sh= with dockerd available.

  #+NAME: dind-run-tests
  #+begin_src python
  @function
  def dind_run_tests(self) -> dagger.Container:
      """Run the project test suite inside Docker-in-Docker (dogfooding).

      Builds a test-ready container from the DinD base, installs Python,
      pytest, and the Dagger CLI, mounts the project source, and runs
      ./test-host.sh with dockerd available.
      Source is mounted last so package installs are cached.
      """
      src = dag.directory().with_directory(
          ".", dag.current_module().source(),
          include=["src/", "sdk/", "tests/", "examples/",
                   "dagger.json", ".daggerignore", "pyproject.toml",
                   "test-host.sh"],
      ).with_new_directory(".git")

      ctr = self.dind_container()
      ctr = (
          ctr
          .with_exec([
              "apt-get", "install", "--yes",
              "python3", "python3-pip", "python3-venv",
          ])
          .with_exec([
              "pip3", "install", "--break-system-packages",
              "pytest", "pytest-asyncio",
          ])
          .with_exec([
              "bash", "-c",
              "curl -fsSL https://dl.dagger.io/dagger/install.sh"
              " | DAGGER_VERSION=0.20.3 BIN_DIR=/usr/local/bin sh",
          ])
          .with_directory("/work", src)
          .with_workdir("/work")
          .with_mounted_cache("/var/lib/docker", dag.cache_volume("dind-docker"))
      )
      cmd = (
          "echo '=== dockerd ready ===' && "
          "docker info --format 'Docker: {{.ServerVersion}}' && "
          "echo '=== running test suite ===' && "
          "./test-host.sh"
      )
      return self.dind_with_docker(cmd=cmd, ctr=ctr)
  #+end_src

* Running org-babel in a container

  The host emacs version affects org-babel output (whitespace,
  formatting).  To get reproducible results we run =run-host.sh=,
  =tangle-host.sh=, and =init-examples-host.sh= inside containers
  with a pinned emacs.

  Two container flavors:

  - =emacs_container= — lightweight: just emacs, git, python, ruff.
    Used by =dind_tangle= which doesn't need Docker or Dagger.
  - =dind_emacs_container= — extends the DinD base with emacs, ruff,
    and the Dagger CLI.  Used by =dind_run_org= and
    =dind_init_examples= whose babel blocks call =dagger call=.

  #+NAME: emacs-container
  #+begin_src python
  @function
  def emacs_container(
      self,
      src: dagger.Directory,
  ) -> dagger.Container:
      """Return a lightweight container with emacs, git, python, and ruff."""
      return (
          dag.container()
          .from_(self.dind_ubuntu_image)
          .with_exec(["apt-get", "update"])
          .with_exec([
              "apt-get", "install", "--yes",
              "emacs-nox", "git", "python3", "python3-pip", "python3-venv",
          ])
          .with_exec([
              "pip3", "install", "--break-system-packages", "ruff",
          ])
          .with_directory("/work", src)
          .with_workdir("/work")
      )
  #+end_src

  #+NAME: dind-emacs-container
  #+begin_src python
  @function
  def dind_emacs_container(self) -> dagger.Container:
      """Return a DinD container with emacs, git, python, ruff, and dagger CLI.

      Does NOT mount source — callers add it last so the entire
      tool install chain is cacheable.
      """
      ctr = self.dind_container()
      return (
          ctr
          .with_exec([
              "apt-get", "install", "--yes",
              "emacs-nox", "git", "python3", "python3-pip", "python3-venv",
          ])
          .with_exec([
              "pip3", "install", "--break-system-packages", "ruff",
          ])
          .with_exec([
              "bash", "-c",
              "curl -fsSL https://dl.dagger.io/dagger/install.sh"
              " | DAGGER_VERSION=0.20.3 BIN_DIR=/usr/local/bin sh",
          ])
      )
  #+end_src

  Each function snapshots =/work= before running the script, then
  returns only the diff — files actually modified by the script.  This
  avoids clobbering files the user may be editing locally.

** Tangling org files

   Tangle only needs emacs — no Docker, no Dagger.  Runs
   =./tangle-host.sh= in the lightweight =emacs_container=.

   #+NAME: dind-tangle
   #+begin_src python
   @function
   def dind_tangle(self) -> dagger.Directory:
       """Tangle org files inside a container and return only the modified files."""
       src = dag.directory().with_directory(
           ".", dag.current_module().source(),
           include=self._EMACS_INCLUDE,
       )
       ctr = self.emacs_container(src=src)
       ctr = ctr.with_mounted_cache("/work/.tangle-deps", dag.cache_volume("tangle-deps"))
       before = ctr.directory("/work")
       after = ctr.with_exec(["./tangle-host.sh"]).directory("/work")
       return before.diff(after)
   #+end_src

** Running org-babel blocks

   Runs =./run-host.sh= with dockerd available (babel blocks call
   =dagger call=) and returns only the modified files.

   #+NAME: dind-run-org
   #+begin_src python
   @function
   def dind_run_org(
       self,
       files: list[str] | None = None,
       no_cache: bool = False,
   ) -> dagger.Directory:
       """Run org-babel blocks inside a DinD container and return only the modified files.

       If files is given, only those org files are processed.
       """
       src = dag.directory().with_directory(
           ".", dag.current_module().source(),
           include=self._EMACS_INCLUDE,
       )
       ctr = self.dind_emacs_container()
       ctr = (
           ctr
           .with_directory("/work", src)
           .with_workdir("/work")
           .with_mounted_cache("/work/.tangle-deps", dag.cache_volume("tangle-deps"))
           .with_mounted_cache("/var/lib/docker", dag.cache_volume("dind-docker"))
       )
       before = ctr.directory("/work")
       cmd = "./run-host.sh"
       if no_cache:
           cmd += " --no-cache"
       if files:
           cmd += " " + " ".join(files)
       after = self.dind_with_docker(cmd=cmd, ctr=ctr).directory("/work")
       return before.diff(after)
   #+end_src

** Initializing examples

   Runs =./init-examples-host.sh= with dockerd available and returns
   only the modified files.

   #+NAME: dind-init-examples
   #+begin_src python
   @function
   def dind_init_examples(
       self,
       from_scratch: bool = False,
       no_cache: bool = False,
   ) -> dagger.Directory:
       """Init example modules inside a DinD container and return only the modified files."""
       src = dag.directory().with_directory(
           ".", dag.current_module().source(),
           include=self._EMACS_INCLUDE,
       )
       ctr = self.dind_emacs_container()
       ctr = (
           ctr
           .with_directory("/work", src)
           .with_workdir("/work")
           .with_mounted_cache("/work/.tangle-deps", dag.cache_volume("tangle-deps"))
           .with_mounted_cache("/var/lib/docker", dag.cache_volume("dind-docker"))
       )
       before = ctr.directory("/work")
       cmd = "./init-examples-host.sh"
       if from_scratch:
           cmd += " --from-scratch"
       elif no_cache:
           cmd += " --no-cache"
       after = self.dind_with_docker(cmd=cmd, ctr=ctr).directory("/work")
       return before.diff(after)
   #+end_src

** Exporting org files to HTML

   Exports org files to HTML for GitHub Pages.  Uses the lightweight
   =emacs_container= (no Docker needed) and returns the =_site/=
   directory containing the HTML output.

   #+NAME: export-html
   #+begin_src python
   @function
   def export_html(self) -> dagger.Directory:
       """Export org files to HTML with noweb expansion for GitHub Pages."""
       src = dag.directory().with_directory(
           ".", dag.current_module().source(),
           include=self._EMACS_INCLUDE,
       )
       ctr = self.emacs_container(src=src)
       ctr = ctr.with_mounted_cache("/work/.tangle-deps", dag.cache_volume("tangle-deps"))
       return ctr.with_exec(["./export-html-host.sh"]).directory("/work/_site")
   #+end_src

  #+NAME: dind_docker_info
  #+begin_src bash :tangle (daggerlib-auto-test) :comments no :padline no
  dagger call dind-with-docker --cmd="docker info --format '{{.OSType}}'" stdout
  #+end_src

  #+RESULTS[ed3d4f41d5700e5de924ac245559d5a3578e180e]: dind_docker_info
  : linux

